Конфигурация/Enums/ВидыПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Владелец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительныйУправляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоминальныйДержатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ИсточникиАнкетИЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИсточникиАнкетИЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПайщиков/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИсточникАнкетИЗаявок") Тогда
		
		Если Параметры.ИсточникАнкетИЗаявок = Перечисления.ИсточникиАнкетИЗаявок.Агент
			или Параметры.ИсточникАнкетИЗаявок = Перечисления.ИсточникиАнкетИЗаявок.Сайт Тогда
			Параметры.Отбор.Вставить("Ссылка", Владелец);
		КонецЕсли;
		
	КонецЕсли;		
		
КонецПроцедуры
